Repository: hudishkin/AnyMetrics
Catalog: AnyMetrics/Resources/*.lproj/Localizable.strings
Languages: ru

# appName
source: AnyMetrics
ru: ЭниМетрикс

# common.optional
source: Optional
ru: Не обяз.

# common.close
source: Close
ru: Закрыть

# common.save
source: Save
ru: Сохранить

# metric.value.good
source: Good
ru: Хорошо

# metric.value.bad
source: Bad
ru: Не хорошо

# metric.add
source: Add
ru: Добавить

# metric.add.title
source: Add Metric
ru: Добавить метрику

# metric.add.custom
source: Create metric
ru: Создать метрику

# metric.actions.update-value
source: Refresh
ru: Обновить значение

# metric.actions.delete
source: Remove
ru: Удалить метрику

# metric.actions.edit
source: Edit
ru: Редактировать

# metric.actions.title
source: Select action for metric «%@»
ru: Что хотите сделать с метрикой «%@»?

# metric.actions.sure
source: You sure?
ru: Вы уверены?

# metric.actions.confirmDelete
source: Delete metric
ru: Да, удалить

# metric.placeholder
source: Press + and add your first metric
ru: Нажмите + и добвьте вашу первую метрику

# httpheaders.select.title
source: Select HTTP Header
ru: Выберите HTTP заголовок

# httpheaders.select.value-title
source: Select Value
ru: Выберите значение

# httpheaders.enter-name
source: HTTP-header title
ru: Название HTTP-заголвока

# httpheaders.enter-value
source: Header Value
ru: Значение

# httpheaders.add.title
source: Add Header
ru: Добавить заголовок

# httpheaders.add.button
source: Add
ru: Добавить

# httpheaders.select-from-list
source: Select HTTP-header from list
ru: Выберите заголвок из списка

# httpheaders.select-values-from-list
source: Select value from list
ru: Выберите значение из списка

# httpheaders.value-information
source: This HTTP-header and value will be send in every request for get metric value.
ru: HTTP-заголвок будет отправляться кажный раз при запросе метрики

# addmetric.title-new
source: New metric
ru: Новая метрика

# addmetric.title-edit
source: Edit
ru: Редактирование

# addmetric.field.type-metric-json
source: Parse JSON
ru: Парсинг JSON

# addmetric.field.type-metric-web
source: Parse HTML
ru: Парсинг HTML

# addmetric.field.type-metric-checkstatus
source: Check HTTP Status (20x is success)
ru: Проверка HTTP статуса (20x - хорошо)

# addmetric.field.type-metric
source: Type metric
ru: Тип метрики

# addmetric.field.http-method
source: HTTP Method
ru: HTTP Метод

# addmetric.field.title
source: Title
ru: Название

# addmetric.field.param-measure
source: Measure
ru: Мера

# addmetric.field.param-measure-placeholder
source: Price, USD
ru: Цена, $

# addmetric.field.value-configure
source: Configure
ru: Настроить

# addmetric.field.json-parse-rule-placeholder
source: Enter parse JSON rule, see FAQ
ru: Правила парсинга JSON, подробнее в FAQ

# addmetric.field.html-parse-rule-placeholder
source: Enter parse HTML rule, see FAQ
ru: Правила парсинга HTML, подробнее в FAQ

# addmetric.field.type-parse-rule-title
source: Select check
ru: Выберите проверку

# addmetric.field.rule-type-none
source: No
ru: Нет

# addmetric.field.rule-type-equal
source: Compare
ru: Сравнить

# addmetric.field.rule-type-contains
source: Must contain
ru: Должно содержать

# addmetric.field.rule-type-placeholder
source: Enter value
ru: Введите значение

# addmetric.field.value-type
source: Value type
ru: Тип значения

# addmetric.field.value-type-currency
source: Currency
ru: Валюта

# addmetric.field.value-type-none
source: Raw
ru: Без формата

# addmetric.field.max-length
source: Cut if longer
ru: Обрезать если длинее

# addmetric.field.case-sensitive
source: Case sensitive
ru: Учитывать размер буквы?

# addmetric.field.rule-type-contains-description
source: Specify the value that will be contained as a result of processing the response. For example: you want to check if a string contains the word "error"
ru: Укажите значение, которое должно содержаться в результате обработки ответа. Например: вы хотите проверить содежится ли в строка слово "ошибка"

# addmetric.field.rule-type-equal-description
source: Specify a value that must match the result of processing the response. For example: you want to check if the answer matches the value "100"
ru: Укажите значение, которое должно совпадать с результатом обработки ответа. Например: вы хотите проверить совпадает ли ответ значению "100"

# addmetric.section.request-settings
source: Request settings
ru: Настройки запроса

# addmetric.section.http-headers
source: HTTP Headers
ru: HTTP заголовки

# addmetric.section.value-settings
source: Value settings
ru: Настройка значения метрики

# addmetric.section.format-settings
source: Format settings
ru: Настройка формата

# addmetric.button.add
source: Add metric
ru: Добавить метрику

# addmetric.button.add-http-header
source: Add Header
ru: Добавить заголвок

# addmetric.button.make-request
source: Make request
ru: Выполнить запрос

# addmetric.text.no-response
source: No response
ru: Нет ответа

# info.title
source: About
ru: О приложении

# info.message
source: AnyMetrics is project developed to solve its own problem and published to App Store for everyone for free. To add a metric to the gallery, send a pull request to the gallery repository on Github.
ru: ЭниМетрик - это open source проект, разработанный для решения собственной проблемы и выложен на GitHub. Что бы добавить в галерею свою метрику нужно отправить PullRequest в репозиторий галереи.

# info.github-app-repo
source: App repository
ru: Код приложения

# info.github-gallery-repo
source: Gallery repository
ru: Репозиторий галереи

# info.version
source: Version: %@
ru: Версия: %@

# info.rate
source: Rate app
ru: Отценить приложение
